/*Написать програмный комплекс КАРУСЕЛЬ, состоящий из диспетчера и исполняемого модуля,
запускаемого многократно в различных терминалах.
/*Общение между диспетчером и модулями происходит через разделяемую память и сигналы
Модуль, после старта заносит в разделяемую память свой идентификатор процесса (ID).
Все модули должны по сигналу от диспетчера прибавлять к некоторому числу,
 размещенному в разделяемой памяти единичку,
 и печатать число в своём терминале. 
 Модуль должен изменить запись о своём ID перед завершением работы.
 */


void main()
{

}
